blog/2020/pick-up-the-pearls.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-01-28 Fri 19:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>把糟粕丢弃，把珍珠拾起</title>
<meta name="generator" content="Org mode">
<link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Noto+Sans+SC&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/theme/normalize.css"/>
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">把糟粕丢弃，把珍珠拾起</h1>
</header><blockquote>
<p>
愚昧并不最可怕的，可怕的是把愚昧当作贴在脸上的金子，以为它到哪里都能发光。
</p>
</blockquote>

<p>
愈生活愈发觉自己的愚昧无知、粗浅鄙陋。
</p>

<p>
我曾经思考生活的终极意义，思考无果，继续生活。遇到诸多困惑，不得解。想求助于现实众人，可是众人皆困于琐事，不能洞察本质。无奈，只得阅古人遗留文字，体味其思想，为我解惑。
</p>

<p>
今日一友问我学习编程之目标，我回答不知道。为什么？只是学到皮毛，未及精深的地方，不能说自己的目标。即便有目标，也不确切。
</p>

<p>
我问自己：我喜欢编程吗？我犹豫了，我不敢肯定地说我喜欢。我怕说喜欢的代价太重。我不知道究竟是因为喜欢编程所以才学，还是因为就业的压力才选择这样一条路。我是个优柔寡断的人，怕走错一步，步步都错。因为肩上背负了责任，知道分担责任。
</p>

<p>
这些东西让我不敢喘息，我却忽视了自己精神生活的需求。我的精神停止进步了，我不再阅读优秀文学书籍，不再看有价值的电影。我忙于编程，我不知道这样做正确与否，总觉得有些不合理的地方。
</p>

<p>
政府对人的思想的钳制终究会酿成大祸。昔人有云："防民之口，甚于防川。"
阻止人民说话的危害超过了堵塞河川的危害。网络上与当局不同的言论一律遭到封杀，不符合主流意识形态的思想坚决摈除。就知道学习，也不知道这个习有什么好学的。
</p>

<p>
我不奢望政府能出台什么好的利民政策，只希望政府不要剥削人民，不要为自己谋私利就行。可惜，这种希望也是一种奢望。
</p>

<p>
我看的书太少，讲不出什么深奥的道理，待我看书学习后，再讲一些我想表达的东西。
</p>
</div>
</body>
</html>